#### `terragrunt plan` Success
<details><summary>Show Output</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.policy["test_policy"] will be created
  + resource "aws_iam_policy" "policy" {
      + arn         = (known after apply)
      + description = "a testing policy"
      + id          = (known after apply)
      + name        = "test_policy"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "directconnect:Describe*",
                          + "directconnect:List*",
                          + "ec2:DescribeVpnGateways",
                          + "ec2:DescribeTransitGateways",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "name" = "PatrickPolicy"
        }
      + tags_all    = {
          + "name" = "PatrickPolicy"
        }
    }

  # aws_iam_policy.policy["test_policy2"] will be created
  + resource "aws_iam_policy" "policy" {
      + arn         = (known after apply)
      + description = "a testing policy"
      + id          = (known after apply)
      + name        = "test_policy2"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "name" = "PatrickPolicy2"
        }
      + tags_all    = {
          + "name" = "PatrickPolicy2"
        }
    }

  # aws_iam_policy.policy["test_policy3"] will be created
  + resource "aws_iam_policy" "policy" {
      + arn         = (known after apply)
      + description = "a testing policy"
      + id          = (known after apply)
      + name        = "test_policy3"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "directconnect:Describe*",
                          + "directconnect:List*",
                          + "ec2:DescribeVpnGateways",
                          + "ec2:DescribeTransitGateways",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "name" = "PatrickPolicy"
        }
      + tags_all    = {
          + "name" = "PatrickPolicy"
        }
    }

  # aws_iam_policy.policy["test_policy99"] will be created
  + resource "aws_iam_policy" "policy" {
      + arn         = (known after apply)
      + description = "a testing policy"
      + id          = (known after apply)
      + name        = "test_policy99"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "directconnect:Describe*",
                          + "directconnect:List*",
                          + "ec2:DescribeVpnGateways",
                          + "ec2:DescribeTransitGateways",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "name" = "PatrickPolicy"
        }
      + tags_all    = {
          + "name" = "PatrickPolicy"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "okta_org_name" but a
│ value was found in file
│ "/github/workspace/staging/accounts/aws-policies/../../../common.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named
│ "vault_google_credentials_path" but a value was found in file
│ "/github/workspace/staging/accounts/aws-policies/../../../common.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Values for undeclared variables
│ 
│ In addition to the other similar warnings shown, 16 other variable(s)
│ defined without being declared.
╵

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
time=2022-01-12T04:50:38Z level=error msg=1 error occurred:
	* exit status 2
```

</details>

*Workflow: `Terragrunt AWS Policies`, Action: `__the-commons-project_terragrunt-github-actions_4`, Working Directory: `./staging/accounts/aws-policies/`, Workspace: `default`*
